      ******************************************************************
      * Author(s): Josiah Basilio, Matthew Christian
      * Date: March 21, 2025
      * Purpose:
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROJECT3_PROGRAM3.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT STOCK-FILE-IN ASSIGN TO "../STOCKS.TXT"
               ORGANIZATION IS LINE SEQUENTIAL.

           SELECT PORTFOLIO-FILE-IN ASSIGN TO "../PORTFOLIO.DAT"
               ORGANIZATION IS INDEXED
               RECORD KEY IS PORTFOLIO-SYM-IN.

           SELECT REPORT-FILE-OUT ASSIGN TO "../REPORT.TXT"
               ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       FD STOCK-FILE-IN.
       01 STOCK-RECORD-IN.
           05 STOCK-SYM-IN PIC X(7).
           05 STOCK-NAME-IN PIC X(25).
           05 CLOSING-PRICE-IN PIC 9(4)V99.

       FD PORTFOLIO-FILE-IN.
       01 PORTFOLIO-RECORD-IN.
           05 PORTFOLIO-SYM-IN PIC X(7).
           05 NUM-SHARES-IN PIC 9(5).
           05 AVG-COST-PER-SHARE-IN PIC 9(4)V99.

       FD REPORT-FILE-OUT.
       01 REPORT-LINE-OUT.
           05 REPORT-LINE PIC X(120).

       WORKING-STORAGE SECTION.
       01 CONTROL-FIELDS.
           *>   Character to indicate the end of a file.
           05 EOF-FLAG-88 PIC A VALUE "N".
               88 NEOF VALUE "N".
               88 EOF VALUE "Y".
           05 EOF-FLAG PIC A.
           05 SUB-1 PIC 9(2).
           05 FOUND-FLAG PIC A.

       01 TABLE-FIELDS.
           05 STOCK-TABLE OCCURS 20 TIMES.
               10 STOCK-SYM-IN-TBL PIC X(7).
               10 STOCK-NAME-IN-TBL PIC X(25).
               10 CLOSING-PRICE-IN-TBL PIC 9(4)V99.

       01 CALC-FIELDS.
           05 UNIT-COST-CALC PIC S9(4)V99.
           05 AT-CLOSING-CALC PIC S9(4)V99.
           05 COST-BASE-CALC PIC S9(5)V99.
           05 MARKET-VALUE-CALC PIC S9(5)V99.
           05 GAIN-LOST-CALC PIC S9(5)V99.
           05 NUM-SHARES-CALC PIC 9(5).

       01 REPORT-FIELDS.
           05 REPORT-HEADER.
               10 FILLER PIC X(22) VALUE "STOCK NAME".
               10 FILLER PIC X(3) VALUE SPACES.
               10 FILLER PIC X(7) VALUE "#SHARES".
               10 FILLER PIC X(3) VALUE SPACES.
               10 FILLER PIC X(9) VALUE "UNIT COST".
               10 FILLER PIC X(3) VALUE SPACES.
               10 FILLER PIC X(10) VALUE "AT CLOSING".
               10 FILLER PIC X(3) VALUE SPACES.
               10 FILLER PIC X(9) VALUE "COST BASE".
               10 FILLER PIC X(3) VALUE SPACES.
               10 FILLER PIC X(12) VALUE "MARKET VALUE".
               10 FILLER PIC X(3) VALUE SPACES.
               10 FILLER PIC X(9) VALUE "GAIN/LOSS".

           05 HEADER-LINE PIC X(120) VALUE ALL "=".

           05 REPORT-RECORD-OUT.
               10 STOCK-NAME-OUT PIC X(25).
               10 FILLER PIC X(3) VALUE SPACES.
               10 NUM-SHARES-OUT PIC ZZZZ9.
               10 FILLER PIC X(3) VALUE SPACES.
               10 UNIT-COST-OUT PIC $$,$$9.99.
               10 FILLER PIC X(3) VALUE SPACES.
               10 AT-CLOSING-OUT PIC $$,$$9.99.
               10 FILLER PIC X(3) VALUE SPACES.
               10 COST-BASE-OUT PIC $$$,$$9.99.
               10 FILLER PIC X(3) VALUE SPACES.
               10 MARKET-VALUE-OUT PIC $$$,$$9.99.
               10 FILLER PIC X(3) VALUE SPACES.
               10 GAIN-LOST-OUT PIC $$$,$$9.99-.

           05 AUDIT-LINE-OUT.
               10 FILLER PIC X(14) VALUE "Records read: ".
               10 READ-CTR PIC 9(2).
               10 FILLER PIC X(3) VALUE SPACES.
               10 FILLER PIC X(17) VALUE "Records written: ".
               10 WRITE-CTR PIC 9(2).

       PROCEDURE DIVISION.
       100-PRODUCE-INVESTMENT-REPORT.
           PERFORM 201-INITALIZE.
           PERFORM 202-PRODUCE-ONE-STOCK-REC UNTIL EOF-FLAG = "Y".
           PERFORM 203-TERMINATE.
            STOP RUN.

       201-INITALIZE.
           PERFORM 301-OPEN-FILES.
           PERFORM 302-LOAD-STOCK-TABLE VARYING SUB-1 FROM 1 BY 1
               UNTIL SUB-1 > 20 OR EOF-FLAG = "Y".
           PERFORM 303-WRITE-REPORT-HEADER.
           PERFORM 304-READ-PORTFOLIO-RECORD.

       202-PRODUCE-ONE-STOCK-REC.
           PERFORM 305-SEARCH-STOCK-TABLE VARYING SUB-1 FROM 1 BY 1
               UNTIL SUB-1 > 20 OR FOUND-FLAG = "Y".
           PERFORM 306-CALC-PORTFOLIO-VALUE.
           PERFORM 307-WRITE-REPORT-RECORD.
           PERFORM 304-READ-PORTFOLIO-RECORD.

       203-TERMINATE.
           PERFORM 308-WRITE-FOOTER.
           PERFORM 309-WRITE-AUDIT-TRAIL.
           PERFORM 310-CLOSE-FILE.

       301-OPEN-FILES.
           OPEN INPUT STOCK-FILE-IN PORTFOLIO-FILE-IN.
           OPEN OUTPUT REPORT-FILE-OUT.

       302-LOAD-STOCK-TABLE.
           READ STOCK-FILE-IN AT END MOVE "Y" TO EOF-FLAG
               NOT AT END
                   MOVE STOCK-RECORD-IN TO STOCK-TABLE(SUB-1)
           END-READ.

       303-WRITE-REPORT-HEADER.
           WRITE REPORT-LINE-OUT FROM HEADER-LINE.
           WRITE REPORT-LINE-OUT FROM REPORT-HEADER.
           WRITE REPORT-LINE-OUT FROM HEADER-LINE.

       304-READ-PORTFOLIO-RECORD.
           READ PORTFOLIO-FILE-IN AT END MOVE "Y" TO EOF-FLAG
               NOT AT END
                   MOVE NUM-SHARES-IN TO NUM-SHARES-CALC
                   MOVE NUM-SHARES-IN TO NUM-SHARES-OUT
                   MOVE AVG-COST-PER-SHARE-IN TO UNIT-COST-CALC
                   MOVE AVG-COST-PER-SHARE-IN TO UNIT-COST-OUT
                   ADD 1 TO READ-CTR
           END-READ.

       305-SEARCH-STOCK-TABLE.
           MOVE "N" TO FOUND-FLAG.
           IF STOCK-SYM-IN-TBL(SUB-1) = PORTFOLIO-SYM-IN
               MOVE STOCK-NAME-IN-TBL(SUB-1) TO STOCK-NAME-OUT
               MOVE CLOSING-PRICE-IN-TBL(SUB-1) TO AT-CLOSING-CALC
               MOVE CLOSING-PRICE-IN-TBL(SUB-1) TO AT-CLOSING-OUT
           END-IF.

       306-CALC-PORTFOLIO-VALUE.
           COMPUTE COST-BASE-CALC = NUM-SHARES-CALC * UNIT-COST-CALC.
           MOVE COST-BASE-CALC TO COST-BASE-OUT.
           COMPUTE MARKET-VALUE-CALC = NUM-SHARES-CALC * AT-CLOSING-CALC.
           MOVE MARKET-VALUE-CALC TO MARKET-VALUE-OUT.
           COMPUTE GAIN-LOST-CALC = MARKET-VALUE-CALC - COST-BASE-CALC.
           MOVE GAIN-LOST-CALC TO GAIN-LOST-OUT.

       307-WRITE-REPORT-RECORD.
           WRITE REPORT-LINE-OUT FROM REPORT-RECORD-OUT.
           ADD 1 TO WRITE-CTR.

       308-WRITE-FOOTER.
           WRITE REPORT-LINE-OUT FROM HEADER-LINE.

       309-WRITE-AUDIT-TRAIL.
           WRITE REPORT-LINE-OUT FROM AUDIT-LINE-OUT
               AFTER ADVANCING 1 LINE.

       310-CLOSE-FILE.
           CLOSE STOCK-FILE-IN PORTFOLIO-FILE-IN REPORT-FILE-OUT.

       END PROGRAM PROJECT3_PROGRAM3.
